# CircularDependency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..CircularDependency Property
BuiltInFailures..::..RegenFailures Class See Also
---
There is a circular chain of references among the highlighted elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularDependency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularDependency As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularDependency {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace